#
# Класс Grammar хранит грамматику языка Милан
#
# Список терминалов, нетерминалов, правила вывода
#
class Grammar

    #Список  терминалов (лексем)
    @@terminals=
    {
      "begin"   => [1,0],
      "end"     => [2,0],
      "if"      => [3,0],
      "then"    => [4,0],
      "else"    => [5,0],
      "while"   => [6,0],
      "do"      => [7,0],
      "for"     => [8,0],
      "to"      => [9, 0],
      "read"    => [10,0],
      "write"   => [11,0],
      "var"     => [12,0],
      "and"     => [13,0],
      "or"      => [14,0],
      "integer" => [15,0],
      "string"  => [16,0],
      ";"       => [20,0],
      "="       => [21,0],
      "<>"      => [21,1],
      "<"       => [21,2],
      ">"       => [21,3],
      "<="      => [21,4],
      ">="      => [21,5],
      "+"       => [22,0],
      "-"       => [22,1],
      "*"       => [23,0],
      "/"       => [23,1],
      ":="      => [24,0],
      "("       => [25,0],
      ")"       => [26,0],
      ":"       => [27,0],
      "."       => [28,0],
      ","       => [29,0]
    }

    #Список нетерминалов
    @@nonterminals=
    {
        "program"           => [100,0],     # Стартовый нетерминал
        "var_define"        => [101,0],     # Объявление переменных
        "var_list"          => [102,0],     # Список переменных
        "var_block"         => [103,0],     # Блок переменных
        "names_list"        => [104,0],     # Список имен
        "type"              => [105,0],     # Тип
        "program_body"      => [106,0],     # Тело программы
        "operators_list"    => [107,0],     # Последовательность операвторов
        "operator"          => [108,0],     # Оператор
        "condition"         => [109,0],     # Условие
        "comparation"       => [110,0],     # Сравнение
        "logic_operator"    => [111,0],     # Логический оператор
        "expression"        => [112,0],     # Выражение
        "num_expression"    => [113,0],     # Числовое выражение
        "str_expression"    => [114,0],     # Строковое выражение
        "term"              => [115,0],     # Часть численного выражения
        "multiplier"        => [116,0],     # Множитель
        "str_term"          => [117,0],     # Часть строкового выражения
        "color_expression"  => [118,0],     # Цветовое выражение
        "ending"            => [119,0]      # Конечный нетерминал
    }

    #Возвращеет список терминалов
    def self.terminals
        return @@terminals
    end

    #Возвращает список нетерминалов
    def self.nonterminals
        return @@nonterminals
    end


end